CommunityGD32Cores/platform-gd32/misc/svd/GD32L23x.svd
     <register>
          <name>IPR25</name>
          <displayName>IPR25</displayName>
          <description>Interrupt Priority Register 25</description>
          <addressOffset>0x319</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_25</name>
              <description>PRI_25</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR26</name>
          <displayName>IPR26</displayName>
          <description>Interrupt Priority Register 26</description>
          <addressOffset>0x31A</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_26</name>
              <description>PRI_26</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR27</name>
          <displayName>IPR27</displayName>
          <description>Interrupt Priority Register 27</description>
          <addressOffset>0x31B</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_27</name>
              <description>PRI_27</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR28</name>
          <displayName>IPR28</displayName>
          <description>Interrupt Priority Register 28</description>
          <addressOffset>0x31C</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_28</name>
              <description>PRI_28</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR29</name>
          <displayName>IPR29</displayName>
          <description>Interrupt Priority Register 29</description>
          <addressOffset>0x31D</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_29</name>
              <description>PRI_29</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR30</name>
          <displayName>IPR30</displayName>
          <description>Interrupt Priority Register 30</description>
          <addressOffset>0x31E</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_30</name>
              <description>PRI_30</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
     <register>
          <name>IPR31</name>
          <displayName>IPR31</displayName>
          <description>Interrupt Priority Register 31</description>
          <addressOffset>0x31F</addressOffset>
          <size>0x08</size>
          <access>read-write</access>
          <resetValue>0x00</resetValue>
          <fields>
            <field>
              <name>PRI_31</name>
              <description>PRI_31</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>    
      </registers>
    </peripheral>
    <peripheral>
      <name>PMU</name>
      <description>Power management unit</description>
      <groupName>PMU</groupName>
      <baseAddress>0x40007000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CTL0</name>
          <displayName>CTL0</displayName>
          <description>power control register 0</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x0000C000</resetValue>
          <fields>     
           <field>
              <name>LDOVS</name>
              <description>LDO output voltage select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
            </field>   
            <field>
              <name>VCRSEL</name>
              <description>VBAT battery charging resistor selection</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>VCEN</name>
              <description>VBAT battery charging enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>LDNP</name>
              <description>Low-driver mode when use normal power LDO in Run/Sleep mode</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>    
            <field>
              <name>LDNPDSP</name>
              <description>Low-driver mode when use normal power LDO in Deep-sleep mode</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>   
            <field>
              <name>BKPWEN</name>
              <description>Backup Domain Write Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LVDT</name>
              <description>Low Voltage Detector Threshold</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
            </field>
            <field>
              <name>LVDEN</name>
              <description>Low Voltage Detector Enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>STBRST</name>
              <description>Standby Flag Reset</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>WURST</name>
              <description>Wakeup Flag Reset</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>LPMOD</name>
              <description>Select the lowpower mode to enter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CS</name>
          <displayName>CS</displayName>
          <description>power control/status register</description>
          <addressOffset>0x04</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>       
            <field>
              <name>LPRDY</name>
              <description>Lowpower LDO ready flag</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>       
            <field>
              <name>NPRDY</name>
              <description>Normal power LDO ready flag</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>       
            <field>
              <name>LDOVSRF</name>
              <description>LDO voltage select ready flag</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN4</name>
              <description>WKUP pin4 Enable</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>WUPEN3</name>
              <description>WKUP pin3 Enable</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field> 
            <field>
              <name>WUPEN2</name>
              <description>WKUP pin2 Enable</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>       
           <field>
              <name>WUPEN1</name>
              <description>WKUP pin1 Enable</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WUPEN0</name>
              <description>WKUP pin0 Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>LVDF</name>
              <description>Low Voltage Detector Status Flag</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STBF</name>
              <description>Standby flag</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WUF</name>
              <description>Wakeup flag</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>       
        <register>
          <name>CTL1</name>
          <displayName>CTL1</displayName>
          <description>power control register 1</description>
          <addressOffset>0x08</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>     
           <field>
              <name>SRAM1PD2</name>
              <description>Power state of 16KB SRAM when enter s Deep sleep2 mode</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>   
            <field>
              <name>NRRD2</name>
              <description>No retention register in Deepsleep 2 mode</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>CORE1WAKE</name>
              <description>COREOFF1 domain wakeup</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>CORE1SLEEP</name>
              <description>COREOFF1 domain go to power-off</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>SRAM1PWAKE</name>
              <description>16KB SRAM wakeup</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>SRAM1PSLEEP</name>
              <description>16KB SRAM go to power off</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>      
        <register>
          <name>STAT</name>
          <displayName>STAT</displayName>
          <description>power Status register (PMU_</description>
          <addressOffset>0x0C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000018</resetValue>
          <fields>     
           <field>
              <name>CORE1PS_ACTIVE</name>
              <description>COREOFF1 domain is in active state</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>   
            <field>
              <name>CORE1PS_SLEEP</name>
              <description>COREOFF1 domain is in sleep state</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>SRAM1PS_ACTIVE</name>
              <description>SRAM1 is in active state</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>SRAM1PS_SLEEP</name>
              <description>SRAM1 is in sleep state</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>DPF2</name>
              <description>This bit is Deep-sleep2 mode status</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>PAR</name>
          <displayName>PAR</displayName>
          <description>Parameter register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x040A2064</resetValue>
          <fields>     
           <field>
              <name>TWKEN</name>
              <description>Use software value when wake up Deep-sleep2 or not</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>   
            <field>
              <name>TWKSRAM1EN</name>
              <description>Use software value when wake up SRAM1 power domain or not</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>TWKCORE1EN</name>
              <description>Use software value when wake up COREOFF1 or not</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>  
            <field>
              <name>TWK_CORE1</name>
              <description>Wakeup time of power switch of COREOFF1 domain</description>
              <bitOffset>21</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TSW_IRC16MCNT</name>
              <description>When enter deep-sleep mode, switch to IRC16M clock</description>
              <bitOffset>16</bitOffset>
              <bitWidth>5</bitWidth>
            </field>
            <field>
              <name>TWK_SRAM1</name>
              <description>Wakeup time of power switch of SRAM1 domain</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
            <field>
              <name>TWK_CORE0</name>
              <description>Wakeup time of power switch of COREOFF0 domain</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
            </field>
          </fields>
        </register>
